# Data Cleaning & Preprocessing in Pandas

Real-world data is **messy** ‚Äî it often contains missing values, duplicates, inconsistent formats, and wrong data types.  
Pandas provides a rich set of tools to **clean, transform, and prepare** your data for analysis.

---

## üß© Handling Missing Values

### Check for Missing Data
```python
df.isnull()          # Returns True for NaN values
df.isnull().sum()    # Count missing values per column
```

---

### Drop Missing Data
```python
df.dropna()          # Drop rows with any missing values
df.dropna(axis=1)    # Drop columns with any missing values
```

---

### Fill Missing Data

In Pandas, `fillna()` replaces missing values.  
`ffill` (forward fill) and `bfill` (backward fill) propagate nearby values.

```python
df.fillna(0)                               # Replace NaN with 0
df["Age"].fillna(df["Age"].mean())         # Replace with mean
df.ffill()                                 # Forward fill (previous value)
df.bfill()                                 # Backward fill (next value)
```

üß† **Tip:** Always decide whether dropping or filling missing data makes sense contextually for your dataset.

---

## üîÅ Detecting & Removing Duplicates

Pandas can easily identify and remove duplicate records.

```python
df.duplicated()         # Returns True for duplicate rows
df.drop_duplicates()    # Removes duplicate rows
```

Check based on specific columns:
```python
df.duplicated(subset=["Name", "Age"])
df.drop_duplicates(subset=["Name", "Age"], keep="first")
```

---

## üî§ String Operations with `.str`

Pandas has vectorized string functions accessible through `.str` ‚Äî faster and more powerful than Python loops.

```python
df["Name"].str.lower()                         # Convert to lowercase
df["City"].str.contains("delhi", case=False)   # Case-insensitive match
df["Email"].str.split("@")                     # Split email into parts
```

You can also chain multiple operations:
```python
df["Name"].str.strip().str.upper()
```

üß† Works just like regular string methods but at the **Series (column)** level.

---

## üî† Type Conversions with `.astype()`

Changing data types helps ensure proper calculations and memory efficiency.

```python
df["Age"] = df["Age"].astype(int)
df["Date"] = pd.to_datetime(df["Date"])
df["Category"] = df["Category"].astype("category")
```

### Why `pd.to_datetime()` is special:

Unlike `.astype()`, it can:

- Handle multiple date formats (`YYYY-MM-DD`, `MM/DD/YYYY`, etc.)  
- Handle mixed/missing types gracefully (`NaT`, `None`)  
- Convert integer timestamps (e.g., UNIX time) into datetime objects  
- Detect and handle **timezones**  

Check current data types:
```python
df.dtypes
```

---

## üßÆ Applying Functions

### Using `.apply()` ‚Äì Apply custom functions to rows or columns
```python
df["Age Group"] = df["Age"].apply(lambda x: "Adult" if x >= 18 else "Minor")
```

### Using `.map()` ‚Äì Element-wise mapping for a Series
```python
gender_map = {"M": "Male", "F": "Female"}
df["Gender"] = df["Gender"].map(gender_map)
```

### Using `.replace()` ‚Äì Replace specific values
```python
df["City"].replace({"Del": "Delhi", "Mum": "Mumbai"}, inplace=True)
```

---

## ‚úÖ Summary

| Task | Method | Description |
|-------|---------|-------------|
| **Detect Missing Data** | `df.isnull()`, `df.isnull().sum()` | Identify NaN values |
| **Drop Missing Data** | `df.dropna()` | Remove missing rows or columns |
| **Fill Missing Data** | `df.fillna()`, `df.ffill()`, `df.bfill()` | Replace or propagate values |
| **Remove Duplicates** | `df.drop_duplicates()` | Remove repeated rows |
| **String Operations** | `df["col"].str.lower()` | Vectorized text operations |
| **Convert Data Types** | `.astype()`, `pd.to_datetime()` | Change data types |
| **Apply Custom Logic** | `.apply()`, `.map()`, `.replace()` | Transform or remap column values |

---

### üí° Key Takeaway

> ‚ÄúData cleaning is where **80% of your time** goes in real-world data projects.‚Äù  

Use:
- `isnull()`, `fillna()`, `dropna()` for missing data  
- `.str` for text cleaning  
- `.astype()` and `pd.to_datetime()` for type conversions  
- `.apply()`, `.map()`, `.replace()` for transformations  

Once your data is **clean**, everything else ‚Äî analysis, visualization, or modeling ‚Äî becomes far easier.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('data2.csv')
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com    1/5/2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12/11/2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com    1/5/2021
7    Alice  25.0     New York      F  alice@example.com    1/5/2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [3]:
df.isnull()                   # True = Null Value

    Name    Age   City  Gender  Email  Join Date
0  False  False  False   False  False      False
1  False   True  False   False  False      False
2  False  False  False   False  False      False
3  False   True  False   False  False      False
4  False  False  False   False  False      False
5   True  False  False   False  False       True
6  False  False  False   False  False      False
7  False  False  False   False  False      False
8  False   True  False   False  False      False

In [4]:
df.isnull().sum()                      # Total count of null values

Name         1
Age          3
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

### Drop Missing Data

In [5]:
df.dropna()                          # Removes rows only

    Name   Age         City Gender              Email   Join Date
0  Alice  25.0     New York      F  alice@example.com    1/5/2021
2    Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  David  22.0       Mumbai      M  david@example.com  12/11/2019
6  Alice  25.0     New York      F  alice@example.com    1/5/2021
7  Alice  25.0     New York      F  alice@example.com    1/5/2021

In [6]:
df.dropna(axis=1)                  # Removes Columns

          City Gender              Email
0     New York      F  alice@example.com
1        Delhi      M    charlie@example
2  Los Angeles      M    bob@example.com
3        Delhi      M    charlie@example
4       Mumbai      M  david@example.com
5        Delhi      F     eve@domain.com
6     New York      F  alice@example.com
7     New York      F  alice@example.com
8        Delhi      M    charlie@example

### Fill Missing Data

In [7]:
df.fillna(0)

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com    1/5/2021
1  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12/11/2019
5        0  28.0        Delhi      F     eve@domain.com           0
6    Alice  25.0     New York      F  alice@example.com    1/5/2021
7    Alice  25.0     New York      F  alice@example.com    1/5/2021
8  Charlie   0.0        Delhi      M    charlie@example  20-07-2021

In [8]:
df["Age"].fillna(df["Age"].mean())                                     # Fill with mean values of age

0    25.000000
1    25.833333
2    30.000000
3    25.833333
4    22.000000
5    28.000000
6    25.000000
7    25.000000
8    25.833333
Name: Age, dtype: float64

In [9]:
df.ffill()                        # St from upper and replace the missing values with last fill

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com    1/5/2021
1  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  30.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12/11/2019
5    David  28.0        Delhi      F     eve@domain.com  12/11/2019
6    Alice  25.0     New York      F  alice@example.com    1/5/2021
7    Alice  25.0     New York      F  alice@example.com    1/5/2021
8  Charlie  25.0        Delhi      M    charlie@example  20-07-2021

In [10]:
df.bfill()                        # St from lower and replace the missing values with last fill

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com    1/5/2021
1  Charlie  30.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  22.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12/11/2019
5    Alice  28.0        Delhi      F     eve@domain.com    1/5/2021
6    Alice  25.0     New York      F  alice@example.com    1/5/2021
7    Alice  25.0     New York      F  alice@example.com    1/5/2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

###  Detecting & Removing Duplicates

In [11]:
df.duplicated()                     # Row index no. True = Duplicate

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [12]:
df.drop_duplicates()              # Returns unique rows

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com    1/5/2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12/11/2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [13]:
 df.duplicated(subset=["Name", "Age"])         # Checks only in perticular columns

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

###  String Operations with .str

In [14]:
df['Name'].str.lower()

0      alice
1    charlie
2        bob
3    charlie
4      david
5        NaN
6      alice
7      alice
8    charlie
Name: Name, dtype: object

In [15]:
 df["City"].str.contains("delhi", case=False) # Checks if 'delhi' is in the city name, case-insensitive.

0    False
1     True
2    False
3     True
4    False
5     True
6    False
7    False
8     True
Name: City, dtype: bool

In [16]:
df["Email"].str.split("@") # Outputs a pandas Series where each element is a list

0    [alice, example.com]
1      [charlie, example]
2      [bob, example.com]
3      [charlie, example]
4    [david, example.com]
5       [eve, domain.com]
6    [alice, example.com]
7    [alice, example.com]
8      [charlie, example]
Name: Email, dtype: object

 We can always chain methods like 
.str.strip().str.upper() for clean-up

### Type Conversions with .astype()

In [17]:
type( df["Email"].str.split("@")[0])

list

In [18]:
df2 = df.dropna().copy()
df2

    Name   Age         City Gender              Email   Join Date
0  Alice  25.0     New York      F  alice@example.com    1/5/2021
2    Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  David  22.0       Mumbai      M  david@example.com  12/11/2019
6  Alice  25.0     New York      F  alice@example.com    1/5/2021
7  Alice  25.0     New York      F  alice@example.com    1/5/2021

In [19]:
df2['Age'] = df2['Age'].astype(int)
df2

    Name  Age         City Gender              Email   Join Date
0  Alice   25     New York      F  alice@example.com    1/5/2021
2    Bob   30  Los Angeles      M    bob@example.com  15-06-2020
4  David   22       Mumbai      M  david@example.com  12/11/2019
6  Alice   25     New York      F  alice@example.com    1/5/2021
7  Alice   25     New York      F  alice@example.com    1/5/2021

In [20]:
#df['Date'] = pd.to_datetime(df['Date'])           #There are diff for the date time data

### Applying Functions

In [21]:
df2['Age Grp'] = df2['Age'].apply(lambda x: "Adult" if x >= 25 else "Minor")

In [22]:
df2

    Name  Age         City Gender              Email   Join Date Age Grp
0  Alice   25     New York      F  alice@example.com    1/5/2021   Adult
2    Bob   30  Los Angeles      M    bob@example.com  15-06-2020   Adult
4  David   22       Mumbai      M  david@example.com  12/11/2019   Minor
6  Alice   25     New York      F  alice@example.com    1/5/2021   Adult
7  Alice   25     New York      F  alice@example.com    1/5/2021   Adult

In [23]:
New column name 
df2['Age Grp'] = df2['Age'].apply(lambda x: 'Adult' if x >= 25 else 'Minor')

SyntaxError: invalid syntax (1575541040.py, line 1)

### Prac.

In [25]:
import pandas as pd
import numpy as np

data = {
    "Name": ["Alice", "Bob", "Charlie", "Bob", "Eva", None],
    "Age": [25, np.nan, 30, 29, None, 22],
    "City": ["Delhi", "Mum", "Delhi", "Mumbai", "Del", "Pune"],
    "Gender": ["F", "M", "M", "M", "F", "F"],
    "Salary": [50000, 62000, None, 62000, 58000, 51000],
    "Date Joined": ["2021-02-05", "2021/03/10", "10-04-2021", None, "2021-05-20", "05/06/2021"]
}

df0 = pd.DataFrame(data)

In [26]:
df0

      Name   Age    City Gender   Salary Date Joined
0    Alice  25.0   Delhi      F  50000.0  2021-02-05
1      Bob   NaN     Mum      M  62000.0  2021/03/10
2  Charlie  30.0   Delhi      M      NaN  10-04-2021
3      Bob  29.0  Mumbai      M  62000.0        None
4      Eva   NaN     Del      F  58000.0  2021-05-20
5     None  22.0    Pune      F  51000.0  05/06/2021

In [44]:
# Q1. Calculate how many missing values exist in each column.
df0.isnull().sum()

Name           1
Age            2
City           0
Gender         0
Salary         1
Date Joined    1
Age Group      0
dtype: int64

In [45]:
# Q2. Fill missing values in the Age column with the average age.
df0['Age'].fillna(df0['Age'].mean())

0    25.0
1    26.5
2    30.0
3    29.0
4    26.5
5    22.0
Name: Age, dtype: float64

In [46]:
# Q3. Remove duplicate records based on Name and Salary, keeping only the last duplicate.

df0.drop_duplicates(subset = ['Name','Salary'],keep = 'last')

      Name   Age    City Gender   Salary Date Joined Age Group
0    Alice  25.0   Delhi      F  50000.0  2021-02-05    Junior
2  Charlie  30.0   Delhi      M      NaN  2021-04-10    Senior
3      Bob  29.0  Mumbai      M  62000.0         NaT    Junior
4      Eva   NaN     Del      F  58000.0  2021-05-20    Junior
5     None  22.0    Pune      F  51000.0  2021-06-05    Junior

In [47]:
# Q4. Correct the values in the City column (Mum ‚Üí Mumbai, Del ‚Üí Delhi).

df0['City'].replace({
    'Mum' : 'Mumbai',
    'Del': 'Delhi'})

0     Delhi
1    Mumbai
2     Delhi
3    Mumbai
4     Delhi
5      Pune
Name: City, dtype: object

In [48]:
# Q5. Convert all values in the Name column to uppercase after removing extra spaces.

df0['Name'].str.strip().str.upper()

0      ALICE
1        BOB
2    CHARLIE
3        BOB
4        EVA
5       None
Name: Name, dtype: object

In [49]:
# Q6. Convert Date Joined to proper datetime format.

df0['Date Joined'] = pd.to_datetime(df0['Date Joined'], format='mixed', dayfirst=True)
df0['Date Joined']

0   2021-02-05
1   2021-03-10
2   2021-04-10
3          NaT
4   2021-05-20
5   2021-06-05
Name: Date Joined, dtype: datetime64[ns]

In [50]:
# Q7. Create a new column Age Group such that:
# If Age ‚â• 30 ‚Üí "Senior"
# If Age < 30 ‚Üí "Junior"

df0['Age Group'] = df0['Age'].apply(lambda x: 'Senior' if x >= 30 else 'Junior')

In [43]:
df0

      Name   Age    City Gender   Salary Date Joined Age Group
0    Alice  25.0   Delhi      F  50000.0  2021-02-05    Junior
1      Bob   NaN     Mum      M  62000.0  2021-03-10    Junior
2  Charlie  30.0   Delhi      M      NaN  2021-04-10    Senior
3      Bob  29.0  Mumbai      M  62000.0         NaT    Junior
4      Eva   NaN     Del      F  58000.0  2021-05-20    Junior
5     None  22.0    Pune      F  51000.0  2021-06-05    Junior